package day15.Abstract;

public class Step1_Abstract정리 {
    /*
        클래스 : 객체를 만들기 위한 하나의 설계도.....


        클래스             vs              추상클래스
        new 가능                           new 불가능
        객채생성o                           객체생성X
        부/자식/객체용도                     부모클래스용도
  목적 : 객체 설계도                         필드/메소드 공통되는 특성을 추출해서 만든 클래스
  상속 : extends                           extends


        추상 클래스 : 서로 다른 클래스들의 공통적인 필드/메소드 설계
                    부모클래스를 다형성(타입변환) 목적으로 많이 사용.

        추상 클래스 선언
        abstract class 추상클래스명{
        //필드
        //생성자
        //메소드
        }

        추상메소드    :      오버라이딩 필수!!



     */
}
